insert into restaurant(name, logo, opening_time, closing_time, average_rate, address_id, created_at) values
    ('باگت', '1', 9, 24, 3, 1, NOW()),
    ('هات', '2', 9, 24, 3, 2, NOW()),
    ('شیلا', '3', 9, 24, 3, 3, NOW()),
    ('مارچوبه', '4', 9, 24, 3, 1, NOW()),
    ('کلانا', '5', 9, 24, 3, 2, NOW()),
    ('کافه ویونا', '6', 9, 24, 3, 3, NOW()),
    ('کافه رئیس', '7', 9, 24, 3, 4, NOW()),
    ('لمیز', '8', 9, 24, 3, 4, NOW());



insert into address(city, area, address_line, created_at) values
    ('تهران', 'میرداماد', 'پلاک 1', NOW()),
    ('تهران', 'قلهک', 'پلاک 2', NOW()),
    ('تهران', 'قیطریه', 'پلاک 3', NOW()),
    ('تهران', 'تجریش', 'پلاک 4', NOW()),
    ('شیراز', 'حافظیه', 'پلاک 5', NOW()),
    ('شیراز', 'سعدیه', 'پلاک 6', NOW()),
    ('شیراز', 'سجادیه', 'پلاک 7', NOW());


insert into category(name, created_at) values
    ('ساندویچ', NOW()),
    ('فست فود', NOW()),
    ('برگر', NOW()),
    ('پیتزا', NOW()),
    ('سالاد', NOW()),
    ('غذای ایرانی', NOW()),
    ('کباب', NOW()),
    ('خورشت', NOW()),
    ('پاستا', NOW());

insert into category_to_restaurant(category_id, restaurant_id, created_at) VALUES
    (1, 1, NOW()),
    (2, 1, NOW()),
    (3, 1, NOW()),
    (4, 1, NOW()),
    (5, 1, NOW()),
    (6, 1, NOW()),
    (1, 2, NOW()),
    (1, 3, NOW()),
    (1, 4, NOW()),
    (1, 5, NOW()),
    (1, 6, NOW()),
    (1, 7, NOW()),
    (1, 8, NOW()),
    (3, 2, NOW()),
    (4, 2, NOW()),
    (5, 2, NOW());


insert into food(name, price, description, food_set, restaurant_id, created_at) VALUES
    ('قرمه سبزی', '1000', 'قرمه و سبزی و گوشت', 'خورشت', 1, NOW()),
    ('قیمه', '1000', 'قیمه و گوشت و لپه و پیاز و فیلان و ماست اضافی :دی', 'خورشت', 1, NOW()),
    ('جوجه', '1000', '', 'چلو', 1, NOW()),
    ('کباب', '1000', '', 'چلو', 1, NOW()),
    ('پپرونی', '1000', 'ژامبون میتهن، قارچ، فلفل دلمه ای، زیتون، ذرت، پیاز، پپرونی، سس مخصوص باگت و خمیر چاودار', 'پیتزا', 1, NOW()),
    ('گوشت و قارچ', '1000', 'ژامبون میتهن، قارچ، فلفل دلمه ای، زیتون، ذرت، پیاز، پپرونی، سس مخصوص باگت و خمیر چاودار', 'پیتزا', 1, NOW()),
    ('مرغ و قارچ', '1000', 'ژامبون میتهن، قارچ، فلفل دلمه ای، زیتون، ذرت، پیاز، پپرونی، سس مخصوص باگت و خمیر چاودار ژامبون میتهن، قارچ، فلفل دلمه ای، زیتون، ذرت، پیاز، پپرونی، سس مخصوص باگت و خمیر چاودار', 'پیتزا', 1, NOW()),
    ('سبزیجات', '1000', 'ندارد', 'پیتزا', 1, NOW()),
    ('استیک', '1000', 'فیله گوساله، پنیر ورقه ای سفید گودا، فلفل دلمه، کاهو، گوجه، سس مخصوص باگت و نان چاودار باگت فیله گوساله، پنیر ورقه ای سفید گودا، فلفل دلمه، کاهو، گوجه، سس مخصوص باگت و نان چاودار باگت', 'ساندویچ', 1, NOW()),
    ('مرغ', '1000', 'فیله گوساله، پنیر ورقه ای سفید گودا، فلفل دلمه، کاهو، گوجه، سس مخصوص باگت و نان چاودار باگت', 'ساندویچ', 1, NOW()),
    ('چیزمرغ', '1000', 'ندارد', 'ساندویچ', 1, NOW()),
    ('چیزگوشت', '1000', 'فیله گوساله، پنیر ورقه ای سفید گودا، فلفل دلمه، کاهو، گوجه، سس مخصوص باگت و نان چاودار باگت', 'ساندویچ', 1, NOW()),
    ('چیز خیلی چیز', '1000', 'نداردنا', 'ساندویچ', 1, NOW()),
    ('سزار', '1000', 'تنگ بازی :دی', 'سالاد', 1, NOW());

insert into comment(author, quality, packaging, delivery_time, delivery_react, restaurant_id, text, created_at) VALUES
    ('اکبر', 3, 3, 3, 3, 1, 'حجم‌ و کیفیت غذا بسیار خوب بود، سس قارچ همراه سیل زمینی خیلی خوشمزه بود ما پینزا خانواده مرغ کاری با سیب زمینی و سس قارچ گرفتیم که سه نفری خوردیم اندازه بک پیتزا هم اضافه اومد', NOW()),
    ('اصغر', 4, 2, 1, 5, 1, 'فیله بوی بدی میداد و اصلا گریل نشده بود. تا چشم کار میکرد کاهو بود و چند تا دونه کرفس و سیب و فلفل دلمه تجربه اولم بود ولی اصلا جالب نبود', NOW()),
    ('سینان', 5, 3, 3, 3, 1, 'بد بد', NOW()),
    ('سیناند', 1, 1, 3, 3, 1, 'خوب خوب', NOW()),
    ('سیناندا', 2, 3, 3, 1, 1, 'اه اه', NOW()),
    ('بهنام', 3, 3, 1, 3, 1, 'من خوابم الان سپیده همش کد میزنه', NOW()),
    ('سپیده', 3, 4, 2, 3, 1, 'من چاقم :(', NOW()),
    ('صدف', 3, 3, 3, 5, 1, 'من فردا کنکور دارم :))))', NOW());
