insert into restaurant(name, logo, opening_time, closing_time, average_rate, address_id) values
    ('باگت', '1', 9, 24, 3, 73),
    ('هات', '2', 9, 24, 3, 74),
    ('شیلا', '3', 9, 24, 3, 75),
    ('مارچوبه', '4', 9, 24, 3, 76);



insert into address(city, area, address_line) values
    ('تهران', 'میرداماد', 'پلاک 1'),
    ('تهران', 'قلهک', 'پلاک 2'),
    ('تهران', 'قیطریه', 'پلاک 3'),
    ('تهران', 'تجریش', 'پلاک 4'),
    ('شیراز', 'حافظیه', 'پلاک 5'),
    ('شیراز', 'سعدیه', 'پلاک 6'),
    ('شیراز', 'سجادیه', 'پلاک 7');
