insert into restaurant(name, logo, opening_time, closing_time, average_rate, address_id) values
    ('باگت', '1', 9, 24, 3, 1),
    ('هات', '2', 9, 24, 3, 2),
    ('شیلا', '3', 9, 24, 3, 3),
    ('مارچوبه', '4', 9, 24, 3, 1),
    ('کلانا', '5', 9, 24, 3, 2),
    ('کافه ویونا', '6', 9, 24, 3, 3),
    ('کافه رئیس', '7', 9, 24, 3, 4),
    ('لمیز', '8', 9, 24, 3, 4);



insert into address(city, area, address_line) values
    ('تهران', 'میرداماد', 'پلاک 1'),
    ('تهران', 'قلهک', 'پلاک 2'),
    ('تهران', 'قیطریه', 'پلاک 3'),
    ('تهران', 'تجریش', 'پلاک 4'),
    ('شیراز', 'حافظیه', 'پلاک 5'),
    ('شیراز', 'سعدیه', 'پلاک 6'),
    ('شیراز', 'سجادیه', 'پلاک 7');


insert into category(name) values
    ('ساندویچ'),
    ('فست فود'),
    ('برگر'),
    ('پیتزا'),
    ('سالاد'),
    ('غذای ایرانی'),
    ('کباب'),
    ('خورشت'),
    ('پاستا');

insert into category_to_restaurant(category_id, restaurant_id) VALUES
    (1, 1),
    (2, 1),
    (3, 1),
    (4, 1),
    (5, 1),
    (6, 1),
    (1, 2),
    (1, 3),
    (1, 4),
    (1, 5),
    (1, 6),
    (1, 7),
    (1, 8),
    (3, 2),
    (4, 2),
    (5, 2);
